 // Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа. 

Console.WriteLine("Введите трёхзначное число");
int a = Convert.ToInt32(Console.ReadLine());
int b = (a / 10) % 10;
if (a < 100 || a > 999)
{
    Console.WriteLine("Некорректные данные");
}
else
{
    Console.WriteLine("{0} - вторая цифра введёного числа",b);
}
